#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#define max(a, b)	(((a) > (b)) ? (a) : (b))		/* ２個の値の最大値 */
#define min(a, b)	(((a) < (b)) ? (a) : (b))		/* ２個の値の最小値 */
#define ENTER		printf("\n")					/* 改行プリント */
/********************************************************************************************************************************/
/* main *************************************************************************************************************************/
/********************************************************************************************************************************/
int DEBUG = 1;										/* デバッグプリント 提出時は0 */
int main()
{
	double	ans = 0;
	int		yn ;
	int		W,H,x,y;
	double	Wf,Hf,xf,yf;

	scanf("%d %d %d %d", &W, &H, &x, &y);
	Wf = W; Hf = H;

	yn = ( (x*2==W)&&(y*2==H) ) ? 1 : 0;

	printf("%.6f %d\n",Wf*Hf/2,yn);

	return 0;
}
